{"_id":{"$oid":"5ad6872acfb50fbc941e2d50"},"projectName":"VIM","companyName":"VIM Fashion Magazine","projectHeading":"Dynamic Redesign Backed By Data","challengeHeading":"Challenge","challenge":"Vim is a fashion magazine produced by a talented group of Michigan State University Students. In today's day tech age, a large part of the publication is their digital presence. They use this site to promote content related to fashion, beauty, fitness, lifestyle, and entertainment. Incorporating these other outlets into the site was essential. The site also needed to be able to be used by many of the writers.","approachHeading":"Approach","approach":"Before site development, I met with lead stakeholders in VIM. There I gathered what they expected out of the site and how they wanted to site to be branded. Next, I conducted some user research. I create a survey to be sent out to users of the site both people who are involved in VIM and other organic users. I also conducted a card sort to help better categorize the many different content types the existing site had.  With the data from the survey and card sort, I was able to provide relevant content to the user, as well as making the findablidy of all content easier. Also, I uncovered that their users were frequently engaging with their content on other digital platforms such as Facebook and Instagram. ","outcomeHeading":"Outcome","outcome":"What I created is an accessible WordPress site. It allows the users to get the content that is most relevant to them while also engaging with the brand's other digital presences. After launching the site, I reevaluated the data and got more feedback from users. Although the users had a better overall impression of the site, some adjustments needed to be made like adding a search feature to specific sections of the site.","tags":["User Experience","Web Development","PHP"],"headingImg":{"imgPath":"/img/","altText":"whats up"},"address":"/work/VIM","getter":"/VIM","bgImage":"/images/vim/headerimg01.jpg","challenge01":{"imgPath":"/images/vim/vimlogo.png","altText":"VIM Fashion Magazine Logo"},"challenge02":{"imgPath":"/images/vim/vimlogo.png","altText":"VIM Fashion Magazine Logo"},"process01":{"imgPath":"/images/vim/process01.jpg","altText":"Showing client example wire frames to landing page of site."},"process02":{"imgPath":"/images/vim/process02.jpg","altText":"Writing on a wall showing the working of VIM's information architecture."},"outcome01":{"imgPath":"/images/vim/outcome01.jpg","altText":"Different screens showing the screens for VIM Fashion Magazine website."}}
{"_id":{"$oid":"5ad68758cfb50fbc941e2e01"},"projectName":"ALC","companyName":"Michigan State University","projectHeading":"Making Education Inclusive","challengeHeading":"Challenge","challenge":"Having just finished my first web design class during the spring 2017 semester I was new and excited to learn more about web development. I was fortunate enough to get a fantastic internship in the Education Technology Department within the College of Arts and Letters at Michigan State University. One of my projects that summer was to build a website for the Accessible Learning Conference we put on every year. At the same time, I was also learning about the world of Accessibility. I mainly focused on web accessibility and making sure that the website I was creating would fit MSU’s WCAG 2.0 AA standard.","approachHeading":"Approach","approach":"I was lucky and had amazing and knowledgeable people teach me about accessibility. Their level of interest in advocating for accessibility inspired me to take what they taught me and build off of it myself. Learning about accessibility while I was getting better with HTML and CSS, help solidify my understanding of HTML and CSS because to make a site accessible the HTML needs to semantic and adequately separated CSS. Creating an accessible website help me understand the specific uses of each HTML tags and how they differ. The site wasn't just HTML and CSS. It was a Wordpress site. I utilized Google and the vast amounts of Wordpress resources from their documentation to articles and video tutorials to get a better understanding of how the content management system works.","outcomeHeading":"Outcome","outcome":"The outcome was as sustainable WordPress website. It was easy to change the site's content to fit where we were with the conference. With analytic data from the site, we have information to inform the future design of the site.","tags":["User Experience","Web Development","PHP"],"headingImg":{"imgPath":"/img/","altText":"whats up"},"address":"/work/alc","getter":"/alc","bgImage":"/images/alc/headerimg01.jpg","challenge01":{"imgPath":"/images/alc/alclogo.jpg","altText":"Accessible Learning Conference Logo"},"challenge02":{"imgPath":"/images/alc/alchome.jpg","altText":"Accessible Learning Conference"},"process01":{"imgPath":"/images/alc/process01.jpg","altText":"Googles Landing page."},"process02":{"imgPath":"/images/alc/process02.jpg","altText":"Accessibility training."},"outcome01":{"imgPath":"/images/alc/outcome01.jpg","altText":"Different screens showing the screens for Accessible Learning Conference website."}}
{"_id":{"$oid":"5ad88d6ccfb50fbc942af75c"},"projectName":"COMOM","companyName":"Colorado Mission of Mercy","projectHeading":"Dental Care for Everyone","challengeHeading":"Challenge","challenge":"Colorado Mission of Mercy is a Charity located in Colorado providing over a $1 Million in dental care to people in Colorado. Their website is an integral part of COMOM because patients sign up for their event through the site. Donators of the charity also use the website to help provide dental access to people who don't usually have access. The old outdated site didn’t give users confidence in the charity they were donating to. ","approachHeading":"Approach","approach":"I worked with COMOM to identify what they liked about the old site and what they expected out of the new site. I set up a Wordpress site for COMOM because it the vast amounts of tutorials and ease of user’s to date the information of the site for when I’m done with the project.","outcomeHeading":"Outcome","outcome":"I built and accessible WordPress site that is more inviting and updated for all users interests.","tags":["User Experience","Web Development","PHP"],"headingImg":{"imgPath":"/img/","altText":"whats up"},"address":"/work/alc","getter":"/comom","bgImage":"/images/comom/headerimg01.jpg","challenge01":{"imgPath":"/images/comom/comomlogo.jpg","altText":"Colorado Mission of Mercy Logo."},"challenge02":{"imgPath":"/images/comom/comomold.jpg","altText":"VIM Fashion Magazine Logo"},"process01":{"imgPath":"/images/comom/process01.jpg","altText":"dental x-ray."},"process02":{"imgPath":"/images/comom/process02.jpg","altText":"dental office"},"outcome01":{"imgPath":"/images/comom/outcome01.jpg","altText":"Different screens showing the screens for Colorado Mission of Mercy website."}}
